{
  "name": "Eskrima Kicks",
  "style": "Karate",
  "category": "Kicks",
  "description": "Arnis/Eskrima/Kali Kicking Techniques\n\nWhile Arnis, Eskrima & Kali is often only associated with stick fighting, this Philippine martial arts is a complete system. Therefore, kicks are used in conjunction with weapons training and/or unarmed combat. In the Philippines, martial arts kicking techniques are known as Pananjakman.\n\nMany Arnis/Eskrima/Kali kicks are low kicks used to catch an opponent off-guard who is focusing on your stick weapon (Yantok), etc. These kicks are designed to incapacitate, injure or knock an opponent off-balance. Targets of these low kicks include an opponent’s foot, knee, calf, shin, groin and quadriceps/thigh muscle. High kicks are usually not used in Arnis/Eskrima/Kali because it is easy to injure your leg and your ability to maneuver if your leg is struck by your opponent’s weapon. Low kicks are used in order to lessen the chance of being hit by your opponent’s weapon.",
  "instructions": "Common kicks employed in Arnis, Eskrima & Kali include roundhouse kicks (i.e. to the knee), stomp kick (i.e. to the foot), side kicks (i.e. to the shin), front kicks (i.e. to groin), foot sweeps (i.e. to knock an opponent off-balance) and knee strikes (i.e. to quadriceps/thigh muscle).\n\nFor more techniques, please visit the main Arnis, Eskrima & Kali section.\n\nMartial arts books are great tools to supplement the information being taught by your martial arts school.\n\nMaterial on this wiki may not be copied or reproduced. All rights reserved. This website is copyright protected under the US Digital Millennium Copyright Act. For other terms & conditions, please read our legal disclaimer and privacy policy.",
  "tips": "",
  "variations": "• Best Books – Visitor favorites!\n• Aikido Books\n• BJJ & Judo Books\n• Flexibility & Stretching Books\n• Karate Books",
  "source_url": "https://blackbeltwiki.com/eskrima-kicks",
  "tags": [
    "kicks",
    "karate"
  ],
  "difficulty_level": 6,
  "belt_level": "Black Belt",
  "cached_at": "2025-06-26T16:57:10.692891"
}