{
  "name": "Outside Crescent Kick – Martial Arts Technique",
  "style": "Karate",
  "category": "Kicks",
  "description": "This page provides details on the martial arts outside crescent kick. The crescent kick is used in many different martial arts styles. For example, the outside crescent kick is known as Bandal Bakkat Chagi in Taekwondo. In Karate, this kick is known as Mikazuki Geri. The outside crescent kick can also be known in English as an out-to-in crescent kick, inwards crescent kick, etc. For information on other martial arts kicks (i.e. spinning hook kick), please visit Black Belt Wiki’s main Martial Arts Kicks section.\n\nThis inside crescent kick travels in a circular motion or arc from the outside to the inside. It strikes an opponent with the inside edge of the foot (or heel of foot in a “crescent axe kick” hybrid variation). An outside crescent kick can be easier to throw than the inside crescent kick. The outside crescent kick is often used when the martial artist is in close and they want to “loop” a kick around an opponent’s body in order to strike the opponent’s head or bring the foot down on the opponent’s clavicle.\n\nMartial arts kicks and all other martial arts techniques should only be practiced under the supervision of a trained martial arts instructor in order to prevent injuries and to ensure the proper technique is utilized. In addition, all martial arts techniques and training should be used safely and responsibly.",
  "instructions": "Crescent Kick Variations\n\nInstructional Video on Outside Crescent Kicks\n\nInstructional Video on Outside Crescent Kicks – Labelled as an Inwards Crescent Kick in this Video",
  "tips": "",
  "variations": "• Inside Crescent Kick\n• Outside Crescent Kick\n• Skipping Crescent Kick – Also known as Hopping Crescent Kick, Sliding Crescent Kick, etc.\n• Spinning Crescent Kick\n• Jumping Spinning Crescent Kick\n• Best Books – Visitor favorites!\n• Aikido Books\n• BJJ & Judo Books\n• Flexibility & Stretching Books\n• Karate Books",
  "source_url": "https://blackbeltwiki.com/outside-crescent-kick",
  "tags": [
    "kicks",
    "karate"
  ],
  "difficulty_level": 4,
  "belt_level": "Black Belt",
  "cached_at": "2025-06-26T16:56:24.967867"
}